202102221554
Tags: 
___
### Оператор прерывания цикла break
Иногда бывает нужно **прервать выполнение цикла преждевременно**. Оператор `break` прерывает ближайший цикл `for` или `while`.

Усовершенствуем программу, проверяющую число на простоту с помощью оператора break:

```python
Напишем программу, определяющую, что число является простым:
num = int(input())
flag = True

for i in range(2, num):
    if num % i == 0:        #  если исходное число делится на какое-либо отличное от 1 и самого себя
        flag = False
        break               # останавливаем цикл если встретили делитель числа        

if flag == True:
    print('Число простое')
else:
    print('Число составное')
```

Как только мы встречаем делитель отличный от 1 и `num`, мы меняем значение сигнальной метки и прерываем цикл, поскольку дальнейшее его выполнение лишено смысла: число гарантированно не является простым.
>Оператор прерывания цикла `break` позволяет ускорять программы, так как мы избавляемся от лишних итераций.

>Оператор прерывания цикла `break` удобен в связке с **[[Сигнальные метки]]**: когда после проверки некоторого условия нам нет смысла продолжать выполнение цикла.

>Оператор `break` прерывает выполнение ближайшего цикла, а не программы, то есть далее будет выполнена команда, следующая сразу за циклом.

#### Бесконечные циклы
Бесконечный цикл продолжает повторяться до тех пор, пока программа не будет прервана. Изучив оператор `break`, мы получили механизм прерывания бесконечных циклов.

Возможно, вам может показатся, что бесконечные циклы лишены смысла, однако это не совсем так. Например, вы можете написать программу, которая запускается и работает, постоянно принимая запросы на обслуживание. Программный код такой программы может выглядеть так:

```python
while True:
    query = get_new_query() #  получаем новый запрос на обработку
    query.process()         #  обрабатываем запрос
```

Иногда с помощью бесконечного цикла удается сделать программный код более читабельным. Более простым может быть завершение цикла на основе условий внутри тела цикла, а не на основе условий в его заголовке:

```python
while True:
    if условие 1:  # условие для остановки цикла
        break
    ...
    if условие 2:  # еще одно условие для остановки цикла
        break
    ...
    if условие 3:  # еще одно условие для остановки цикла
        break
```

В подобных случаях, когда существует множество причин завершения цикла, часто их проще выделить из нескольких разных мест, чем пытаться указать все условия завершения в заголовке цикла.

>**Важно:** бесконечные циклы могут быть очень полезными. Просто помните, что вы должны убедиться, что цикл в какой-то момент будет прерван, чтобы он действительно не становился бесконечным.

### Оператор continue
Оператор `continue` позволяет перейти к следующей итерации цикла `for` или `while` до завершения всех команд в теле цикла.

Напишем программу, которая выводит все числа от 1 до 100, кроме чисел 7, 17, 29 и 78.

```python
for i in range(1, 101):
    if i == 7 or i == 17 or i == 29 or i == 78:
        continue  # переходим на следующую итерацию
    print(i)
```
### Блок else в циклах
Синтаксис такой конструкции следующий:

```python
while условие:
    блок кода1
else:
    блок кода2

# или

for i in range(10):
    блок кода1
else:
    блок кода2
```

`Блок кода2`, указанный в `else`, будет выполнен, когда **штатным образом** завершается цикл `while` или `for`.
>Если слово `else` отсутствует в описании цикла, то `блок кода2` будет выполняться после завершения цикла, несмотря ни на что. Если же слово `else` присутствует, то `блок кода2` будет выполняться только в том случае, если цикл завершается **штатным образом**. Под **штатным завершением** цикла, подразумевается его завершение **без** использования оператора прерывания `break`.

>Оператор `continue` не влияет на выполнение блока `else` в циклах.

>Блок `else` в циклах часто применяется для обработки отсутствия элементов.


___
##### Links


---
##### Источники
